# DATA CLEANING

In [1]:
# Import files

In [2]:
import pandas as pd

In [3]:
pwd

'C:\\Users\\User\\OneDrive\\CLEAR\\3.A.PANDAS'

In [4]:
df = pd.read_csv('nba.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      456 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   372 non-null    object
 8   Salary    445 non-null    float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 39.4+ KB

In [6]:
df.isnull().sum

<bound method DataFrame.sum of       Name   Team  Number  Position    Age  Height  Weight  College  Salary  \
0    False  False   False     False  False   False   False    False   False
1    False  False   False     False  False   False   False    False   False
2    False  False   False     False  False   False   False    False    True
3    False  False   False     False  False   False   False    False   False
4    False  False   False     False  False   False   False     True   False
..     ...    ...     ...       ...    ...     ...     ...      ...     ...
452   True   True    True      True   True    True    True     True    True
453  False  False   False     False  False   False   False    False   False
454  False  False   False     False  False   False   False     True   False
455  False  False   False     False  False   False   False     True   False
456  False  False   False     False  False   False   False    False   False

     Bonus  Sales
0     True   True
1     True   True
2     True   True
3     True   True
4     True   True
..     ...    ...
452   True   True
453   True   True
454   True   True
455   True   True
456   True   True

[457 rows x 11 columns]>

In [7]:
df.isnull().sum()

Name          1
Team          1
Number        1
Position      1
Age           1
Height        1
Weight        1
College      85
Salary       12
Bonus       457
Sales       457
dtype: int64

In [8]:
df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,06-Feb,180.0,Texas,7730337.0,NaN,NaN
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,06-Jun,235.0,Marquette,6796117.0,NaN,NaN
2,John Holland,Boston Celtics,30.0,SG,27.0,06-May,205.0,Boston University,NaN,NaN,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,06-May,185.0,Georgia State,1148640.0,NaN,NaN
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,06-Oct,231.0,NaN,5000000.0,NaN,NaN
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,06-Sep,240.0,NaN,12000000.0,NaN,NaN
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,06-Aug,235.0,LSU,1170960.0,NaN,NaN
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,NaN,NaN
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,06-Feb,190.0,Louisville,1824360.0,NaN,NaN
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,06-Apr,220.0,Oklahoma State,3431040.0,NaN,NaN

In [9]:
df.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
454,Raul Neto,Utah Jazz,25.0,PG,24.0,06-Jan,179.0,NaN,900000.0,NaN,NaN
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,07-Mar,256.0,NaN,2900000.0,NaN,NaN
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,NaN,NaN

# INTENDATION

In [74]:
df[['Name']].shape

(0, 1)

In [13]:
df[['Team']]

               Team
0    Boston Celtics
1    Boston Celtics
2    Boston Celtics
3    Boston Celtics
4    Boston Celtics
..              ...
452             NaN
453       Utah Jazz
454       Utah Jazz
455       Utah Jazz
456       Utah Jazz

[457 rows x 1 columns]

In [15]:
df.iloc[234,:]

Name            JaVale McGee
Team        Dallas Mavericks
Number                    11
Position                   C
Age                       28
Height                   7-0
Weight                   270
College               Nevada
Salary           1.27096e+06
Bonus                    NaN
Sales                    NaN
Name: 234, dtype: object

In [16]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary', 'Bonus', 'Sales'],
      dtype='object')

In [18]:
df[['Team', 'Position']].head(3)

             Team Position
0  Boston Celtics       PG
1  Boston Celtics       SF
2  Boston Celtics       SG

In [19]:
df[['Number', 'Height', 'Weight']]

     Number  Height  Weight
0       0.0  06-Feb   180.0
1      99.0  06-Jun   235.0
2      30.0  06-May   205.0
3      28.0  06-May   185.0
4       8.0  06-Oct   231.0
..      ...     ...     ...
452     NaN     NaN     NaN
453     8.0  06-Mar   203.0
454    25.0  06-Jan   179.0
455    21.0  07-Mar   256.0
456    24.0     7-0   231.0

[457 rows x 3 columns]

In [26]:
newdf = df[['Number', 'Height', 'Salary']]

In [27]:
newdf.head(3)

   Number  Height     Salary
0     0.0  06-Feb  7730337.0
1    99.0  06-Jun  6796117.0
2    30.0  06-May        NaN

In [36]:
df.isnull().sum()

Name          1
Team          1
Number        1
Position      1
Age           0
Height        1
Weight        1
College      85
Salary        0
Bonus       457
Sales       457
dtype: int64

In [33]:
df['Salary'] = df['Salary'].fillna(0)

In [35]:
df['Age'] = df['Age'].fillna(0)

In [37]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
Bonus       float64
Sales       float64
dtype: object

In [40]:
df['College'] = df['College'].fillna('No college')

In [41]:
df.isnull().sum()

Name          1
Team          1
Number        1
Position      1
Age           0
Height        1
Weight        1
College       0
Salary        0
Bonus       457
Sales       457
dtype: int64

In [42]:
df['Name'] = df['Name'].fillna('No name')

In [43]:
df.isnull().sum()

Name          0
Team          1
Number        1
Position      1
Age           0
Height        1
Weight        1
College       0
Salary        0
Bonus       457
Sales       457
dtype: int64

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       457 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 39.4+ KB

In [72]:
new_df = df.dropna()

In [59]:
new_df.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
Bonus       0
Sales       0
dtype: int64

In [60]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
Bonus       float64
Sales       float64
dtype: object

In [68]:
df.head(3)

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary, Bonus, Sales]
Index: []

In [70]:
df['Age'] = df['Age'].add(5)

In [71]:
df.head(4)

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary, Bonus, Sales]
Index: []